{
    "frameworks": [
        {
            "type": "Full-stack Frameworks/Toolkits",
            "children": [
                {
                    "url": "http://jquery.com/",
                    "name": "jQuery",
                    "license": "MIT and GPL licenses",
                    "source": "GitHub",
                    "summary": "A framework that simplifies DOM traversing, event handling, animating and Ajax interactions for rapid web development. jQueryUI library includes UI components."
                },
                {
                    "url": "http://dojotoolkit.org/",
                    "name": "Dojo Toolkit",
                    "license": "BSD license or the Academic Free License version 2.1",
                    "source": "Hosted SVN",
                    "summary": "A full stack framework and component set for building web-based and mobile applications that includes DOM manipulation, Ajax, animations, effects, and widgets."
                },
                {
                    "url": "http://www.sencha.com/products/extjs/",
                    "name": "ExtJS",
                    "license": "GNU GPL license v3 and paid Commercial licenses available",
                    "source": "No",
                    "summary": "A full stack framework and extensive UI component set for building web-based rich internet applications."
                },
                {
                    "url": "http://twitter.github.com/bootstrap/",
                    "name": "Twitter Bootstrap",
                    "license": "Apache v2",
                    "source": "GitHub",
                    "summary": "A  toolkit for kickstarting HTML, CSS and JavaScript for websites and apps including base styles for typography, forms, buttons, tables, grids, navigation, alerts, and more."
                },
                {
                    "url": "http://yuilibrary.com/",
                    "name": "YUI",
                    "license": "BSD",
                    "source": "GitHub",
                    "summary": "A lightweight and modular JavaScript and CSS framework for building interactive web applications."
                },
                {
                    "url": "http://mootools.net/",
                    "name": "MooTools",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A modular, object-oriented framework that re-creates pseudo-classical inheritance with Classes that allow for extensible and reusable behaviors."
                },
                {
                    "url": "http://www.kendoui.com/",
                    "name": "Kendo",
                    "license": "GPLv3 and paid Commercial licenses available",
                    "source": "No",
                    "dependencies": "jQuery",
                    "summary": "A full stack framework for building JavaScript-based web and mobile applicatings including support for templates, themes and UI widgets."
                },
                {
                    "url": "http://prototypejs.org/",
                    "name": "Prototype",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A framework including a toolkit for class-driven development and an Ajax library."
                },
                {
                    "url": "http://sproutcore.com/",
                    "name": "SproutCore",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "An MVC application framework for data-centric applications that includes data bindings."
                },
                {
                    "url": "http://emberjs.com/",
                    "name": "Ember.js",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "Framework that tries to eliminate boilerplate and provide a standard architecture. Includes bindings, computed properties and auto-updating templates. Formerly SproutCore 2.0."
                },
                {
                    "url": "https://github.com/fohr/blossom",
                    "name": "Blossom",
                    "license": "GPL v3",
                    "source": "GitHub",
                    "summary": "Another SproutCore fork, it re-architects the view layer to be HTML/CSS-independent while providing a high-performance animation subsystem that leverages hardware acceleration."
                },
                {
                    "url": "http://code.google.com/closure/",
                    "name": "Google Closure",
                    "license": "Apache v2",
                    "source": "Google Code",
                    "summary": "Developed by Google engineers, it includes features like a JavaScript optimizer, a library of UI widgets and controls, a templating engine and extensions to CSS."
                },
                {
                    "url": "http://cappuccino.org/",
                    "name": "Cappuccino",
                    "license": "LGPL",
                    "source": "GitHub",
                    "summary": "Created with Objective-J, which is modelled after Objective-C but on JavaScript, it abstracts away HTML, CSS and the DOM and implements APIs from GNUstep and Cocoa."
                },
                {
                    "url": "http://towerjs.org/",
                    "name": "Tower.js",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A full stack web framework for Node.js and the Browser built on top of Node's Connect and Express and modeled after Ruby on Rails."
                },
                {
                    "url": "http://dhtmlx.com/index.shtml",
                    "name": "DHTMLX",
                    "license": "Standard Edition is GNU GPL v2, Commercial &amp; Enterprise versions available.",
                    "source": "No",
                    "summary": "Includes collections of user interface components, allowing you to create robust web interfaces, manage client-server communications with Ajax, and implement server-side logic."
                },
                {
                    "url": "http://www.corechain.com/index.html",
                    "name": "CoreChain",
                    "license": "MIT and GPL",
                    "source": "No",
                    "summary": "CoreChain consists of a Core module which controls DOM and Event, a UI module for component architecture and a Graph module based on Canvas. (Documentation in Korean)"
                },
                {
                    "url": "http://qooxdoo.org/about",
                    "name": "qooxdoo",
                    "license": " GNU LGPL and the Eclipse Public License (EPL)",
                    "source": "GitHub",
                    "summary": "A JavaScript framework for creating apps for a wide range of platforms (mobile, website, desktop, server) that are object-oriented and utilize a comprehensive tool chain."
                },
				{
					"url": "http://developer.yahoo.com/cocktails/mojito/",
					"name": "Mojito",
					"license": "MIT",
					"source": "GitHub",
					"summary": "A JavaScript framework from Yahoo built on top of YUI 3 for writing apps that run on both the client (browser) and server (Node.js)."
				},
				{
					"url": "http://www.meteor.com/",
					"name": "Meteor",
					"license": "MIT",
					"source": "GitHub",
					"summary": "A pure JavaScript framework for both client and server that includes live page updates, data synchronization, hot code pushes and more."
				},
				{
					"url": "http://qatrix.com",
					"name": "Qatrix",
					"license": "MIT",
					"source": "GitHub",
					"summary": "Includes hardware accelerated animation, DOM element selectors, DOM manipulation, event handling, AJAX, cache system and a library of useful functions."
				}
            ]
        },
        {
            "type": "Architectural Frameworks",
            "children": [
                {
                    "url": "http://knockoutjs.com/",
                    "name": "Knockout.js",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A lightweight framework for building JavaScript UI's with declarative bindings using the Model-View-View Model (MVVM) pattern."
                },
                {
                    "url": "http://documentcloud.github.com/backbone/",
                    "name": "Backbone.js",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "An architectural framework provides things like models key-value binding and custom events, views with declarative event handling and a RESTful JSON interface."
                },
                {
                    "url": "http://angularjs.org/",
                    "name": "AngularJS",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "An MVC and dependency injection framework that includes support for declarative UI templates and two-way binding."
                },
                {
                    "url": "http://spinejs.com/",
                    "name": "Spine",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A lightweight MVC framework built with, but not requiring, CoffeeScript that includes features like asynchronous server communication, a full model layer and ORM."
                },
                {
                    "url": "http://agilityjs.com/",
                    "name": "Agility.js",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "An MVC library that works with a single object type that contains a full model-view-controller stack."
                },
                {
                    "url": "http://sammyjs.org/",
                    "name": "Sammy.js",
                    "license": "MIT",
                    "summary": "A very lightweight framework for applications made up primarily of routes and events that is designed to be modular, with adapters and plugins."
                },
                {
                    "url": "http://javascriptmvc.com/",
                    "name": "JavaScriptMVC",
                    "license": "MIT",
                    "source": "GitHub",
                    "dependencies": "jQuery",
                    "summary": "Comprised of 4 sub projects including the DocumentJS documentation engine, FuncUnit testing framework, jQueryMX MVC extensions and StealJS code manager."
                },
                {
                    "url": "http://batmanjs.org/",
                    "name": "Batman.js",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A framework for building applications with CoffeeScript or JavaScript including a system of view bindings and observable properties"
                },
                {
                    "url": "http://somajs.github.com/somajs/",
                    "name": "Soma.js",
                    "license": "Mozilla Public License (MPL) Version 1.1",
                    "source": "GitHub",
                    "summary": "MVC framework focused on loosely-coupled apps that implements the Observer and Command patterns via the native JavaScript event system. Includes a MooTools version."
                },
				{
					"url": "http://canjs.us/",
					"name": "CanJS",
					"license": "MIT",
					"source": "GitHub",
					"summary": "A lightweight (8.5kb) architectural framework that includes binding, template loading/caching and more. Supports jQuery, Zepto, Dojo, YUI and Mootools out of the box."
				},
				{
					"url": "https://github.com/scottburch/river-js",
					"name": "River",
					"license": "not defined",
					"source": "GitHub",
					"summary": "River is a modular Javascript framework, not a MVC framework, designed to facilitate code organizing and coordinating framework using the Facade/Mediator pattern."
				},
				{
					"url": "http://rhysbrettbowen.github.com/PlastronJS/",
					"name": "PlastronJS",
					"license": "MIT",
					"source": "GitHub",
					"summary": "An MVC framework for Closure Library and Closure Compiler."
				}
            ]
        },
        {
            "type": "Supplementary Libaries",
            "children": [
                {
                    "url": "http://amplifyjs.com/",
                    "name": "AmplifyJS",
                    "license": "MIT or GPLv2",
                    "source": "GitHub",
                    "dependencies": "jQuery",
                    "summary": "A set of components to simplify data handling and AJAX request management by providing a unified API for various data sources."
                },
                {
                    "url": "http://documentcloud.github.com/underscore/",
                    "name": "Underscore",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A library that provides functions and helpers for functional programming support including function binding, JavaScript templates and more."
                },
                {
                    "url": "https://github.com/janl/mustache.js",
                    "name": "Mustache.js",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "An implementation of the Mustache logic-less template system in JavaScript."
                },
                {
                    "url": "http://handlebarsjs.com/",
                    "name": "Handlebars.js",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A library that works in conjunction with Mustache.js to let you build semantic templates."
                },
                {
                    "url": "http://requirejs.org/",
                    "name": "RequireJS",
                    "license": "BSD and MIT",
                    "source": "GitHub",
                    "summary": "A JavaScript file and module loader optimized for the browser but works with server-side solutions like Node and Rhino."
                },
                {
                    "url": "http://microjs.com/",
                    "name": "Microjs ",
                    "license": "depends on micro-framework or micro-library",
                    "source": "GitHub",
                    "summary": "A large collection of micro-frameworks each with a very limited and specific intent."
                },
                {
                    "url": "http://ukijs.org/",
                    "name": "UKI",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A simple JavaScript user interface toolkit for desktop-like web applications that comes with a rich view-component library."
                },
                {
                    "url": "http://beebole.com/pure/",
                    "name": "Pure",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A templating tool to generate HTML from JSON data that can work standalone or with dojo, DomAssistant, jQuery, Mootools, Prototype, Sizzle and Sly."
                }
            ]
        },
        {
            "type": "Graphics/Animation",
            "children": [
                {
                    "url": "http://easeljs.com/",
                    "name": "EaselJS",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A library to simplify working with the html5 canvas element including a full, hierarchical display list and a core interaction model."
                },
                {
                    "url": "http://paperjs.org/",
                    "name": "Paper.js",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "An open source vector graphics scripting framework that runs on top of the HTML5 Canvas."
                },
                {
                    "url": "http://raphaeljs.com/index.html",
                    "name": "Raphael",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A small JavaScript library to simplify working with vector graphics via SVG and VML."
                },
				{
					"url": "http://lib.ivank.net/",
					"name": "IvanK Lib",
					"license": "MIT",
					"source": "No",
					"summary": "A JavaScript 2D graphics library inspired by Flash."
				}
            ]
        },
        {
            "type": "Mobile Specific",
            "children": [
                {
                    "url": "http://jquerymobile.com/",
                    "name": "jQuery Mobile",
                    "license": "MIT and GPLv2",
                    "source": "GitHub",
                    "dependencies": "jQuery",
                    "summary": "A HTML5-base UI system for all popular mobile device platforms, built on a jQuery and jQuery UI foundation."
                },
                {
                    "url": "http://www.sencha.com/products/touch/",
                    "name": "Sencha Touch",
                    "license": "GNU GPL license v3 and free Commercial licenses available",
                    "source": "No",
                    "summary": "A mobile web app development framework built with HTML5, CSS3, and Javascript and including components like audio and video, a localStorage proxy and styling layer."
                },
                {
                    "url": "http://zeptojs.com/",
                    "name": "Zepto ",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "Primarily focused on mobile, this is  a minimalist JavaScript framework with a jQuery-compatible syntax."
                },
                {
                    "url": "http://the-m-project.org/",
                    "name": "The M Project",
                    "license": "MIT &amp; GPL",
                    "source": "GitHub",
                    "dependencies": "jQuery, jQuery Mobile",
                    "summary": "An MVC framework for mobile app development including features like offline support, local storage, positioning, a touch-optimized UI, i18n support and native packing via Espresso."
                },
                {
                    "url": "http://www.jqmobi.com/",
                    "name": "jQ.Mobi",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "The jQuery framework rewritten from the ground up to be optimized for mobile browsers on iOS and Android."
                },
                {
                    "url": "http://spinejs.com/mobile/index",
                    "name": "Spine Mobile",
                    "license": "MIT",
                    "source": "GitHub",
                    "dependencies": "Spine",
                    "summary": "Built on top of Spine that, it strives for a native look-and-feel and includes features like specialized controllers and panel layout, hardware accelerated transitions and touch events."
                },
                {
                    "url": "https://github.com/gobhi/gbone.js",
                    "name": "gbone.js",
                    "license": "MIT",
                    "source": "GitHub",
                    "dependencies": "Backbone.js, Underscore.js, Zepto or jQuery",
                    "summary": "Inspired by Spine Mobile but written for Backbone and adding design patterns like observer and cleanup mixins based on Backbone.js on Rails ebook."
                },
                {
                    "url": "http://jqtouch.com/",
                    "name": "jQTouch",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A plugin for Zepto or jQuery designed for mobile web development on the iPhone, Android and iPod Touch."
                },
                {
                    "url": "http://enyojs.com/",
                    "name": "Enyo",
                    "license": "Apache v2",
                    "source": "GitHub",
                    "summary": "An object-oriented JavaScript framework built for mobile first, though it supports desktop browsers, and powering WebOS."
                },
                {
                    "url": "http://www.chocolatechip-ui.com/",
                    "name": "ChocolateChip UI (ChUI)",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A framework for mobile web application on the WebKit platform that provides layouts and widgets with built-in functionality. Has been ported to jQuery and Zepto."
                },
                {
                    "url": "http://xuijs.com/",
                    "name": "xui.js",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "An extremely small DOM library for authoring html5 mobile web applications. Originally written for PhoneGap by members of the PhoneGap team."
                },
                {
                    "url": "http://joapp.com/",
                    "name": "Jo",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A framework for mobile HTML5 web or native apps that includes widgets, lists and scrolling goodness using JavaScript and CSS3. Works well with PhoneGap."
                },
                {
                    "url": "http://dojotoolkit.org/features/mobile",
                    "name": "Dojo Mobile",
                    "license": "BSD license or the Academic Free License version 2.1",
                    "source": "Hosted SVN",
                    "summary": "An HTML5 and JavaScript framework that focuses on a native look and feel on modern webkit-enabled mobile devices such as iPhone, iPod Touch, iPad, Android and RIM."
                },
                {
                    "url": "http://dhtmlx.com/touch/",
                    "name": "DHTMLX Touch",
                    "license": "GNU GPL and free commercial Licenses",
                    "source": "No",
                    "summary": "A full framework and UI widgets for building HTML5-based mobile web apps."
                },
				{
					"url": "http://moobilejs.com/",
					"name": "Moobile",
					"license": "MIT",
					"source": "No",
					"dependencies": "Mootools",
					"summary": "A mobile application framework built on top of Mootools."
				}
            ]
        },
        {
            "type": "Server-side JS",
            "children": [
                {
                    "url": "http://nodejs.org/",
                    "name": "Node.js",
                    "license": "MIT (included libraries vary)",
                    "source": "GitHub",
                    "summary": " Platform built on Chrome's JavaScript runtime for building network applications using an event-driven, non-blocking I/O model for data-intensive real-time applications."
                },
                {
                    "url": "http://www.mozilla.org/rhino/",
                    "name": "Rhino",
                    "license": "MPL 1.1/GPL 2.0 license",
                    "source": "GitHub",
                    "summary": " An implementation of JavaScript written entirely in Java typically for embedding into Java applications to provide scripting to end users."
                }
            ]
        },
        {
            "type": "Testing",
            "children": [
                {
                    "url": "http://visionmedia.github.com/mocha/",
                    "name": "Mocha",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A JavaScript test framework running on node and the browser for asynchronous testing."
                },
                {
                    "url": "http://docs.jquery.com/QUnit",
                    "name": "QUnit",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "QUnit is a JavaScript test suite used by the jQuery project to test its code and plugins but capable of testing any generic JavaScript code."
                },
                {
                    "url": "https://github.com/marstall/shim/",
                    "name": "Shim",
                    "license": "unknown",
                    "source": "GitHub",
                    "dependencies": "Node.js",
                    "summary": "A cross-browser and cross-device compatibility testing framework."
                },
                {
                    "url": "https://github.com/douglascrockford/JSDev",
                    "name": "JSDev",
                    "license": "Not listed",
                    "source": "GitHub",
                    "summary": "A filter that is useful for testing as it activates selected comments, making them executable."
                },
                {
                    "url": "http://www.phantomjs.org/",
                    "name": "PhantomJS",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "Designed for headless website testing, Shim is a headless WebKit with JavaScript API including native support for DOM handling, CSS selector, JSON, Canvas, and SVG."
                },
                {
                    "url": "https://github.com/WebReflection/wru",
                    "name": "wru",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A general purpose test framework compatible with web environment, node.js, Rhino, and now PhantomJS."
                },
                {
                    "url": "http://sinonjs.org/",
                    "name": "SinonJS",
                    "license": "Simplified BSD",
                    "source": "GitHub",
                    "summary": "Standalone test spies, stubs and mocks for JavaScript with no dependencies and works with any unit testing framework."
                },
                {
                    "url": "http://pivotal.github.com/jasmine/",
                    "name": "Jasmine",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A behavior-driven development framework for testing JavaScript code that does not depend on any other JavaScript frameworks."
                },
				{
					"url": "http://yuilibrary.com/projects/yuitest/",
					"name": "YUI Test",
					"license": "BSD",
					"source": "GitHub",
					"summary": "Allows writing unit tests that can be run in web browsers or on the command line, as well as functional tests to be run in web browsers."
				},
				{
					"url": "https://github.com/cucumber/cucumber-js",
					"name": "Cucumber.js",
					"license": "MIT",
					"source": "GitHub",
					"summary": "A port of the Cucumber Behaviour-Driven Development tool to JavaScript that runs on both Node.js and modern web browsers."
				},
				{
					"url": "http://busterjs.org/",
					"name": "Buster.js",
					"license": "BSD",
					"source": "No",
					"summary": "A JavaScript testing toolkit for browsers and Node that offers browser automation, static html page testing, testing in headless browsers and more."
				},
				{
					"url": "http://casperjs.org/",
					"name": "CasperJS",
					"license": "MIT",
					"source": "GitHub",
					"dependencies": "PhantomJS",
					"summary": "An open source navigation scripting & testing utility written in Javascript and based on PhantomJS."
				},
				{
					"url": "http://www.jscheck.org/",
					"name": "JSCheck",
					"license": "Public Domain",
					"source": "GitHub",
					"summary": "A specification-driven testing tool inspired by QuickCheck."
				}
            ]
        },
        {
            "type": "Gaming",
            "children": [
                {
                    "url": "http://impactjs.com/",
                    "name": "Impact",
                    "license": "Paid commercial license",
                    "source": "No",
                    "summary": "Impact is a JavaScript Game Engine that allows you to develop stunning HTML5 Games for desktop and mobile browsers."
                },
                {
                    "url": "https://github.com/mrdoob/three.js",
                    "name": "ThreeJS",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": " A lightweight 3D library designed for a very low level of complexity and providing canvas, svg and WebGL renderers."
                },
                {
                    "url": "http://createjs.com/",
                    "name": "CreateJS",
                    "license": "MIT",
                    "source": "GitHub",
                    "summary": "A whole suite of libraries, including EaselJs, TweenJS, SoundJS, PreloadJS and Zoe, designed for creating games and animations."
                },
				{
					"url": "http://craftyjs.com/",
					"name": "Crafty",
					"license": "MIT or GPL",
					"source": "GitHub",
					"summary": "Crafty is a game library including features like entities and components, rendering to Canvas or DOM and event binding."
				}
            ]
        },
        {
            "type": "Languages That Compile to JavaScript",
            "children": [
                {
                    "url": "http://coffeescript.org/",
                    "name": "CoffeeScript",
                    "license": "MIT",
                    "source": "GitHub",
                    "dependencies": "Node.js",
                    "summary": "Billed as an attempt to expose the good parts of JavaScript in a simple way."
                },
                {
                    "url": "http://www.dartlang.org/",
                    "name": "Google Dart",
                    "license": "BSD",
                    "source": "Google Code",
                    "summary": "Intended to solve JavaScript's problems and offer better performance, including  the ability 'to be more easily tooled for large-scale projects' and better security features."
                },
                {
                    "url": "http://brunch.io/",
                    "name": "Brunch",
                    "license": "MIT",
                    "source": "GitHub",
                    "dependencies": "CoffeeScript, Backbone.js, Underscore.js, Stitch, Eco, Stylus &amp; jQuery.",
                    "summary": "Billed as 'a lightweight approach to building HTML5 applications with emphasis on elegance and simplicity.'"
                },
                {
                    "url": "https://github.com/clojure/clojurescript",
                    "name": "ClojureScript",
                    "license": "Eclipse Public License 1.0",
                    "source": "GitHub",
                    "summary": "A compiler for Clojure that targets JavaScript and is designed to emit JavaScript code which is compatible with the advanced compilation mode of the Google Closure compiler."
                },
                {
                    "url": "http://code.google.com/webtoolkit/",
                    "name": "Google Web Toolkit(GWT)",
                    "license": "Creative Commons Attribution 3.0 License",
                    "source": "No",
                    "summary": "The GWT SDK contains the Java API libraries, compiler, and development server that let you write client-side applications in Java and deploy them as JavaScript."
                },
                {
                    "url": "http://www.jangaroo.net/home/",
                    "name": "Jangaroo",
                    "license": "Apache License 2.0",
                    "source": "GitHub",
                    "summary": "Cross compiles ActionScript 3 to JavaScript. Includes libraries for flash runtime emulation and interfacing with other frameworks, such as ExtJS."
                }
            ]
        }
    ]
}